import database as db

# راه‌اندازی اولیه دیتابیس و جداول جدید
db.init_db()

# سوالات مود دوستانه و عادی
db.add_question("truth", "friendly", "بزرگترین ترس زندگیت چیه؟")
db.add_question("dare", "friendly", "به نفر سمت چپت یک لیوان آب بده.")

# سوالات مود پارتنری عاشقانه
db.add_question("truth", "romantic", "اولین بار کی و چطور فهمیدی که دوستم داری؟")
db.add_question("dare", "romantic", "قشنگ‌ترین ویژگی ظاهری من رو با جزئیات توصیف کن.")

# سوالات مود پارتنری +18
db.add_question("truth", "nsfw", "فانتزی مورد علاقه‌ات که تا حالا به کسی نگفتی چیه؟")
db.add_question("dare", "nsfw", "یک وویس ۵ ثانیه‌ای با لحن بسیار آروم و صمیمی برام بفرست.")

print("✅ سوالات نمونه با موفقیت به دیتابیس اضافه شدند!")